# Задайте последовательность чисел. Напишите программу, 
# которая выведет список неповторяющихся элементов исходной последовательности.

# *Пример*

# - при [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]     ->        [2, 4, 5, 9]
lst = [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]
count = 1
lst_3 =[]
print(f"Исходный список: {lst}")
set_ =set(lst)
lst_2 = list(set_)

# for i in lst:
#     if lst[i] == lst:
#         i += 1
#     else:
#         lst_3.append(lst)

   
print(lst_2)
        